#+AUTHOR:Melvin Wevers
#+TITLE: Chapter 9. Big Entropy and the Generalized Linear Model
#+PROPERTY: header-args :session :results value :cache no :exports both


Bet on the distribution with the biggest entropy
1. This distribution is the widest and least informative distribution. The resulting
   distribution embodies the least information while remaining true to the information
   we've provided.
2. Nature tends to produce empirical distributions that have high entropy. 
3. The approach has solved difficult problems in the past. 

*Generalized Linear Models* and the principle of *Maximum Entropy*

GLMS need not use Gaussian likelihoods. 
The principle of maximum entropy helps us choose likelihood functions, by providing a way
to use stated assumptions about constraints on the outcome variavble to choose the
likelihood function that is the most conservative distribution compatible with the known
constrains. 

* 9.1. Maximum Entropy

Information entropy = $ -\sum_{i} p_{i} * log * p_{i} $

*Maximum Entropy Principle*
The distribution that can happen the most ways is also the distribution with the biggest
information entropy. The distribution with the biggest entropy is the most conservative
distribution that obeys its constraints.

#+BEGIN_SRC R
p <- list()
p$A <- c(0,0,10,0,0)
p$B <- c(0,1,8,1,0)
p$C <- c(0,2,6,2,0)
p$D <- c(1,2,4,2,1)
p$E <- c(2,2,2,2,2)

p_norm <- lapply(p, function(q) q/sum(q))

( H <- sapply( p_norm , function(q) -sum(ifelse(q==0,0,q*log(q))) ) )

#+END_SRC

#+RESULTS:
|                 0 |
| 0.639031859650177 |
| 0.950270539233235 |
|  1.47080847632211 |
|   1.6094379124341 |

#+BEGIN_SRC R
ways <- c(1,90,1260,37800,113400)
logwayspp <- log(ways)/10

#+END_SRC

#+RESULTS:
|                 0 |
| 0.449980967033026 |
| 0.713886699994552 |
|  1.05400643816077 |
|  1.16386766702758 |

Information entropy is a way of counting how many unique arrangements correspond to a
distribution.

The distribution that can happen the greatest number of ways is the most plausible
distribution. *Maximum Entropy Distribution*

